Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad.LoadCoordinateEnum Enumeration
 This defines whether local or global coordinates are used for loading the coordinate system.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadCoordinateEnum
Public Enumeration LoadCoordinateEnum
Members
Member name | Value | Description
USE_LOCAL_COORDINATES | 0 |  Local coordinates are used.
USE_GLOBAL_COORDINATES | 1 |  Global coordinates are used.
See Also
Reference
Tekla.Structures.Analysis Namespace